import React, { Component } from "react";

export default class AdminMenu extends Component {
  render() {
    return (
      <div className="gov_menu">
        <div className="podraz_results">
          <div className="podraz_info">
            <div className="podraz_title">Результаты подразделений</div>
            <ol>
              <li className="podraz_color_1">
                <span className="podraz_name">Название отдела</span>
              </li>
              <li className="podraz_color_2">
                <span className="podraz_name">Название отдела</span>
              </li>
              <li className="podraz_color_3">
                <span className="podraz_name">Название отдела</span>
              </li>
              <li className="podraz_color_4">
                <span className="podraz_name">Название отдела</span>
              </li>
            </ol>
          </div>
          <div className="podraz_diagrama">
            <div className="diagrama"></div>
          </div>
        </div>
        <div className="tasks">
          <div className="tasks_title">Задания</div>
          <div className="tasks_row">
            <div className="tasks_col">Название</div>
            <div className="tasks_col">Вопросы</div>
            <div className="tasks_col">Прошедших</div>
          </div>
          <div className="tests">
            <div className="test">
              <div className="test_name">
                <div className="test_title">Тест 2</div>
                <div className="test_subtitle">Описание теста</div>
              </div>
              <div className="test_value">30</div>
              <div className="test_past">30</div>
              <div className="test_edit">
                <svg
                  className="edit"
                  width="26"
                  height="26"
                  viewBox="0 0 26 26"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path d="M2.84526 23.1507H4.83693L17.1071 10.863L15.1154 8.86849L2.84526 21.1562V23.1507ZM23.1888 8.79726L17.1427 2.8137L19.1343 0.819178C19.6797 0.273059 20.3497 0 21.1445 0C21.9383 0 22.6079 0.273059 23.1533 0.819178L25.1449 2.8137C25.6903 3.35982 25.9748 4.01896 25.9985 4.79112C26.0222 5.56234 25.7614 6.221 25.2161 6.76712L23.1888 8.79726ZM21.126 10.8986L6.04617 26H0V19.9452L15.0799 4.84384L21.126 10.8986ZM16.1113 9.86575L15.1154 8.86849L17.1071 10.863L16.1113 9.86575Z" />
                </svg>
              </div>
              <div className="test_delete">
                <svg
                  className="delete"
                  width="25"
                  height="28"
                  viewBox="0 0 25 28"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    className="delete"
                    d="M4.6875 28C3.82812 28 3.09271 27.6956 2.48125 27.0869C1.86875 26.4771 1.5625 25.7444 1.5625 24.8889V4.66667C1.11979 4.66667 0.748438 4.51785 0.448438 4.22022C0.149479 3.92156 0 3.55185 0 3.11111C0 2.67037 0.149479 2.30067 0.448438 2.002C0.748438 1.70437 1.11979 1.55556 1.5625 1.55556H7.8125C7.8125 1.11481 7.9625 0.745111 8.2625 0.446444C8.56146 0.148815 8.93229 0 9.375 0H15.625C16.0677 0 16.4391 0.148815 16.7391 0.446444C17.038 0.745111 17.1875 1.11481 17.1875 1.55556H23.4375C23.8802 1.55556 24.251 1.70437 24.55 2.002C24.85 2.30067 25 2.67037 25 3.11111C25 3.55185 24.85 3.92156 24.55 4.22022C24.251 4.51785 23.8802 4.66667 23.4375 4.66667V24.8889C23.4375 25.7444 23.1318 26.4771 22.5203 27.0869C21.9078 27.6956 21.1719 28 20.3125 28H4.6875ZM4.6875 4.66667V24.8889H20.3125V4.66667H4.6875ZM7.8125 20.2222C7.8125 20.663 7.9625 21.0321 8.2625 21.3298C8.56146 21.6284 8.93229 21.7778 9.375 21.7778C9.81771 21.7778 10.1891 21.6284 10.4891 21.3298C10.788 21.0321 10.9375 20.663 10.9375 20.2222V9.33333C10.9375 8.89259 10.788 8.52289 10.4891 8.22422C10.1891 7.92659 9.81771 7.77778 9.375 7.77778C8.93229 7.77778 8.56146 7.92659 8.2625 8.22422C7.9625 8.52289 7.8125 8.89259 7.8125 9.33333V20.2222ZM14.0625 20.2222C14.0625 20.663 14.2125 21.0321 14.5125 21.3298C14.8115 21.6284 15.1823 21.7778 15.625 21.7778C16.0677 21.7778 16.4391 21.6284 16.7391 21.3298C17.038 21.0321 17.1875 20.663 17.1875 20.2222V9.33333C17.1875 8.89259 17.038 8.52289 16.7391 8.22422C16.4391 7.92659 16.0677 7.77778 15.625 7.77778C15.1823 7.77778 14.8115 7.92659 14.5125 8.22422C14.2125 8.52289 14.0625 8.89259 14.0625 9.33333V20.2222ZM4.6875 4.66667V24.8889V4.66667Z"
                  />
                </svg>
              </div>
            </div>
            <div className="test">
              <div className="test_name">
                <div className="test_title">Тест 2</div>
                <div className="test_subtitle">Описание теста</div>
              </div>
              <div className="test_value">30</div>
              <div className="test_past">30</div>
              <div className="test_edit">
                <svg
                  className="edit"
                  width="26"
                  height="26"
                  viewBox="0 0 26 26"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path d="M2.84526 23.1507H4.83693L17.1071 10.863L15.1154 8.86849L2.84526 21.1562V23.1507ZM23.1888 8.79726L17.1427 2.8137L19.1343 0.819178C19.6797 0.273059 20.3497 0 21.1445 0C21.9383 0 22.6079 0.273059 23.1533 0.819178L25.1449 2.8137C25.6903 3.35982 25.9748 4.01896 25.9985 4.79112C26.0222 5.56234 25.7614 6.221 25.2161 6.76712L23.1888 8.79726ZM21.126 10.8986L6.04617 26H0V19.9452L15.0799 4.84384L21.126 10.8986ZM16.1113 9.86575L15.1154 8.86849L17.1071 10.863L16.1113 9.86575Z" />
                </svg>
              </div>
              <div className="test_delete">
                <svg
                  className="delete"
                  width="25"
                  height="28"
                  viewBox="0 0 25 28"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    className="delete"
                    d="M4.6875 28C3.82812 28 3.09271 27.6956 2.48125 27.0869C1.86875 26.4771 1.5625 25.7444 1.5625 24.8889V4.66667C1.11979 4.66667 0.748438 4.51785 0.448438 4.22022C0.149479 3.92156 0 3.55185 0 3.11111C0 2.67037 0.149479 2.30067 0.448438 2.002C0.748438 1.70437 1.11979 1.55556 1.5625 1.55556H7.8125C7.8125 1.11481 7.9625 0.745111 8.2625 0.446444C8.56146 0.148815 8.93229 0 9.375 0H15.625C16.0677 0 16.4391 0.148815 16.7391 0.446444C17.038 0.745111 17.1875 1.11481 17.1875 1.55556H23.4375C23.8802 1.55556 24.251 1.70437 24.55 2.002C24.85 2.30067 25 2.67037 25 3.11111C25 3.55185 24.85 3.92156 24.55 4.22022C24.251 4.51785 23.8802 4.66667 23.4375 4.66667V24.8889C23.4375 25.7444 23.1318 26.4771 22.5203 27.0869C21.9078 27.6956 21.1719 28 20.3125 28H4.6875ZM4.6875 4.66667V24.8889H20.3125V4.66667H4.6875ZM7.8125 20.2222C7.8125 20.663 7.9625 21.0321 8.2625 21.3298C8.56146 21.6284 8.93229 21.7778 9.375 21.7778C9.81771 21.7778 10.1891 21.6284 10.4891 21.3298C10.788 21.0321 10.9375 20.663 10.9375 20.2222V9.33333C10.9375 8.89259 10.788 8.52289 10.4891 8.22422C10.1891 7.92659 9.81771 7.77778 9.375 7.77778C8.93229 7.77778 8.56146 7.92659 8.2625 8.22422C7.9625 8.52289 7.8125 8.89259 7.8125 9.33333V20.2222ZM14.0625 20.2222C14.0625 20.663 14.2125 21.0321 14.5125 21.3298C14.8115 21.6284 15.1823 21.7778 15.625 21.7778C16.0677 21.7778 16.4391 21.6284 16.7391 21.3298C17.038 21.0321 17.1875 20.663 17.1875 20.2222V9.33333C17.1875 8.89259 17.038 8.52289 16.7391 8.22422C16.4391 7.92659 16.0677 7.77778 15.625 7.77778C15.1823 7.77778 14.8115 7.92659 14.5125 8.22422C14.2125 8.52289 14.0625 8.89259 14.0625 9.33333V20.2222ZM4.6875 4.66667V24.8889V4.66667Z"
                  />
                </svg>
              </div>
            </div>
            <div className="test_create">
              <div className="test_create_button">+</div>
            </div>
          </div>
        </div>
        <div className="results">
          <div className="results_name">Результаты пользователей</div>
          <div className="results_row">
            <div className="results_col">Фамилия имя</div>
            <div className="results_col">Правильных ответов</div>
            <div className="results_col">Подразделение</div>
          </div>
          <div className="result">
            <div className="result_user">
              <div className="result_avatar">
                <div className="avatar"></div>
              </div>
              <div className="result_name">
                <div className="name">Имя</div>
                <div className="surname">Фамилия</div>
              </div>
            </div>
            <div className="result_answers">30</div>
            <div className="result_podrazdelenie">Название подразделения</div>
          </div>
        </div>
      </div>
    );
  }
}
